Repository: mishrafabric/cmux
Catalog: Packages/macOS/CmuxNext/Sources/CmuxNextAgentPane/Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, km, ko, nb, pl, pt_br, ru, th, tr, uk, vi, zh_hans, zh_hant

# agentPane.addRoot.add
source: Add Folder
ar: إضافة المجلد
bs: Dodaj folder
da: Tilføj mappe
de: Ordner hinzufügen
es: Añadir carpeta
fr: Ajouter le dossier
it: Aggiungi cartella
ja: フォルダを追加
km: បន្ថែមថត
ko: 폴더 추가
nb: Legg til mappe
pl: Dodaj folder
pt_br: Adicionar pasta
ru: Добавить папку
th: เพิ่มโฟลเดอร์
tr: Klasör Ekle
uk: Додати папку
vi: Thêm thư mục
zh_hans: 添加文件夹
zh_hant: 加入檔案夾

# agentPane.shell.gestureRequired
source: Not run
ar: لم يُشغَّل
bs: Nije pokrenuto
da: Ikke kørt
de: Nicht ausgeführt
es: No ejecutado
fr: Non exécutée
it: Non eseguito
ja: 未実行
km: មិនបានដំណើរការ
ko: 실행 안 됨
nb: Ikke kjørt
pl: Nie uruchomiono
pt_br: Não executado
ru: Не выполнено
th: ไม่ได้รัน
tr: Çalıştırılmadı
uk: Не виконано
vi: Chưa chạy
zh_hans: 未运行
zh_hant: 未執行

# agentPane.shell.tooMany
source: Too many commands running
ar: أوامر كثيرة قيد التشغيل
bs: Previše naredbi radi
da: For mange kommandoer kører
de: Zu viele Befehle laufen
es: Demasiados comandos en ejecución
fr: Trop de commandes en cours
it: Troppi comandi in esecuzione
ja: 実行中のコマンドが多すぎます
km: ពាក្យបញ្ជាកំពុងដំណើរការច្រើនពេក
ko: 실행 중인 명령이 너무 많음
nb: For mange kommandoer kjører
pl: Zbyt wiele uruchomionych poleceń
pt_br: Comandos demais em execução
ru: Слишком много команд выполняется
th: คำสั่งทำงานอยู่มากเกินไป
tr: Çok fazla komut çalışıyor
uk: Забагато команд виконується
vi: Quá nhiều lệnh đang chạy
zh_hans: 运行中的命令过多
zh_hant: 執行中的命令過多

# agentPane.shell.folderMissing
source: Folder not found
ar: المجلد غير موجود
bs: Mapa nije pronađena
da: Mappen blev ikke fundet
de: Ordner nicht gefunden
es: Carpeta no encontrada
fr: Dossier introuvable
it: Cartella non trovata
ja: フォルダが見つかりません
km: រកមិនឃើញថតឯកសារ
ko: 폴더를 찾을 수 없음
nb: Fant ikke mappen
pl: Nie znaleziono folderu
pt_br: Pasta não encontrada
ru: Папка не найдена
th: ไม่พบโฟลเดอร์
tr: Klasör bulunamadı
uk: Папку не знайдено
vi: Không tìm thấy thư mục
zh_hans: 未找到文件夹
zh_hant: 找不到資料夾

# agentPane.shell.unknownRun
source: Output unavailable
ar: المخرجات غير متاحة
bs: Izlaz nije dostupan
da: Output ikke tilgængeligt
de: Ausgabe nicht verfügbar
es: Salida no disponible
fr: Sortie indisponible
it: Output non disponibile
ja: 出力を利用できません
km: លទ្ធផលមិនមាន
ko: 출력을 사용할 수 없음
nb: Utdata utilgjengelig
pl: Wyjście niedostępne
pt_br: Saída indisponível
ru: Вывод недоступен
th: เอาต์พุตไม่พร้อมใช้งาน
tr: Çıktı kullanılamıyor
uk: Вивід недоступний
vi: Đầu ra không khả dụng
zh_hans: 输出不可用
zh_hant: 輸出無法使用

# agentPane.shell.spawnFailed
source: Could not start
ar: تعذّر البدء
bs: Nije moguće pokrenuti
da: Kunne ikke starte
de: Start fehlgeschlagen
es: No se pudo iniciar
fr: Impossible de démarrer
it: Avvio non riuscito
ja: 開始できませんでした
km: មិនអាចចាប់ផ្តើមបាន
ko: 시작할 수 없음
nb: Kunne ikke starte
pl: Nie można uruchomić
pt_br: Não foi possível iniciar
ru: Не удалось запустить
th: เริ่มไม่ได้
tr: Başlatılamadı
uk: Не вдалося запустити
vi: Không thể bắt đầu
zh_hans: 无法启动
zh_hant: 無法啟動

# agentPane.error.turnUndoGesture
source: Undo needs a click or key press in the pane.
ar: يحتاج التراجع إلى نقرة أو ضغطة مفتاح في اللوحة.
bs: Poništavanje traži klik ili pritisak tipke u panelu.
da: Fortryd kræver et klik eller tastetryk i panelet.
de: Rückgängig braucht einen Klick oder Tastendruck im Bereich.
es: Deshacer necesita un clic o una pulsación de tecla en el panel.
fr: L’annulation nécessite un clic ou une touche dans le panneau.
it: Annulla richiede un clic o un tasto nel pannello.
ja: 元に戻すには、ペイン内でのクリックかキー操作が必要です。
km: ការមិនធ្វើវិញត្រូវការការចុច ឬការចុចគ្រាប់ចុចក្នុងផ្ទាំង។
ko: 실행 취소하려면 창에서 클릭하거나 키를 눌러야 합니다.
nb: Angre krever et klikk eller tastetrykk i panelet.
pl: Cofnięcie wymaga kliknięcia lub naciśnięcia klawisza w panelu.
pt_br: Desfazer precisa de um clique ou de uma tecla no painel.
ru: Для отмены нужен щелчок или нажатие клавиши в панели.
th: การเลิกทำต้องมีการคลิกหรือกดแป้นในแผง
tr: Geri almak için panelde bir tıklama veya tuşa basma gerekir.
uk: Для скасування потрібне клацання або натискання клавіші в панелі.
vi: Hoàn tác cần một lần nhấp hoặc nhấn phím trong khung.
zh_hans: 撤销需要在窗格中点击或按键。
zh_hant: 還原需要在窗格中點按或按鍵。

# agentPane.error.turnUndoInvalid
source: The app refused the undo request.
ar: رفض التطبيق طلب التراجع.
bs: Aplikacija je odbila zahtjev za poništavanje.
da: Appen afviste anmodningen om at fortryde.
de: Die App hat die Rückgängig-Anfrage abgelehnt.
es: La app rechazó la solicitud de deshacer.
fr: L’app a refusé la demande d’annulation.
it: L’app ha rifiutato la richiesta di annullamento.
ja: アプリが元に戻す要求を拒否しました。
km: កម្មវិធីបានបដិសេធសំណើមិនធ្វើវិញ។
ko: 앱이 실행 취소 요청을 거부했습니다.
nb: Appen avviste angreforespørselen.
pl: Aplikacja odrzuciła prośbę o cofnięcie.
pt_br: O app recusou o pedido de desfazer.
ru: Приложение отклонило запрос на отмену.
th: แอปปฏิเสธคำขอเลิกทำ
tr: Uygulama geri alma isteğini reddetti.
uk: Застосунок відхилив запит на скасування.
vi: Ứng dụng đã từ chối yêu cầu hoàn tác.
zh_hans: 应用拒绝了撤销请求。
zh_hant: App 拒絕了還原要求。

# agentPane.shell.completionTimedOut
source: Completion timed out
ar: انتهت مهلة الإكمال
bs: Dovršavanje je isteklo
da: Fuldførelsen fik timeout
de: Vervollständigung hat das Zeitlimit überschritten
es: Se agotó el tiempo de la finalización
fr: Délai de complétion dépassé
it: Tempo scaduto per il completamento
ja: 補完がタイムアウトしました
km: ការបំពេញស្វ័យប្រវត្តិអស់ពេល
ko: 자동 완성 시간이 초과되었습니다
nb: Fullføringen fikk tidsavbrudd
pl: Przekroczono limit czasu uzupełniania
pt_br: A conclusão excedeu o tempo limite
ru: Время автодополнения истекло
th: การเติมข้อความหมดเวลา
tr: Tamamlama zaman aşımına uğradı
uk: Час автодоповнення вичерпано
vi: Hoàn thành tự động đã hết thời gian
zh_hans: 补全超时
zh_hant: 補全逾時

# agentPane.chooseFolder.notSaved
source: The folder could not be saved.
ja: フォルダを保存できませんでした。

# agentPane.chooseFolder.restartService
source: Restart cmux's background service to use Choose Folder.
ja: 「フォルダを選択」を使うには、cmux のバックグラウンドサービスを再起動してください。

# agentPane.chooseFolder.message
source: New agent chats in this workspace start in the folder you choose.
ja: このワークスペースの新しいエージェントチャットは、選んだフォルダで始まります。

# agentPane.chooseFolder.prompt
source: Choose
ja: 選択

# agentPane.confirmOption.message
source: Change %1$@ to %2$@? Paired devices could then run actions without asking.
ja: %1$@ を %2$@ に変更しますか？ ペアリングされたデバイスが、確認なしで操作を実行できるようになります。

# agentPane.openOutside.title
source: Open a file outside this project?
ja: このプロジェクト外のファイルを開きますか？

# agentPane.openOutside.open
source: Open
ja: 開く

# agentPane.error.replyLink
source: The app refused this link.
ja: アプリがこのリンクを拒否しました。

# agentPane.enableHarness.title
source: Enable harness %@?
ja: ハーネス %@ を有効にしますか？

# agentPane.enableHarness.message
source: A file in %@ asks to run this program with your rights in chats inside that folder. Enable it only if you trust every line below.
ja: %@ 内のファイルが、このフォルダ内のチャットであなたの権限でこのプログラムを実行しようとしています。以下のすべての行を信頼できる場合にのみ有効にしてください。

# agentPane.enableHarness.file
source: File: %@
ja: ファイル: %@

# agentPane.enableHarness.command
source: Command: %@
ja: コマンド: %@

# agentPane.enableHarness.program
source: Program: %@
ja: プログラム: %@

# agentPane.enableHarness.noProgram
source: Program: not found on PATH now
ja: プログラム: 現在 PATH に見つかりません

# agentPane.enableHarness.noEnv
source: Environment: none
ja: 環境変数: なし

# agentPane.enableHarness.envPlain
source: Environment %1$@ = %2$@
ja: 環境変数 %1$@ = %2$@

# agentPane.enableHarness.envKeychain
source: Environment %1$@ = Keychain item %2$@
ja: 環境変数 %1$@ = キーチェーン項目 %2$@

# agentPane.enableHarness.envLogin
source: Environment %1$@ = your login variable %2$@
ja: 環境変数 %1$@ = ログイン環境の変数 %2$@

# agentPane.enableHarness.checked
source: Checked file: %@ (a change asks again)
ja: 確認対象のファイル: %@（変更されると再度確認します）

# agentPane.enableHarness.warning
source: Warning: %@
ja: 警告: %@

# agentPane.enableHarness.enable
source: Enable Harness
ja: ハーネスを有効にする
